<?php

$city = array (
  'Украина' => array (
    0 => 'Харьков',
    1 => 'Киев',
    2 => 'Одесса',
    3 => 'Львов',
    4 => 'Запорожье',
    5 => 'Ужгород',
  ),
  'Россия' => array (
    0 => 'Санкт-Петербург',
    1 => 'Москва',
    2 => 'Екатеринбург',
    3 => 'Смоленск',
    4 => 'Рязань',
    5 => 'Владимир',
  ),
  'Франция' => array (
    0 => 'Париж',
    1 => 'Марселль',
    2 => 'Ницца',
    3 => 'Лион',
  ),
  'Польша' => array (
    0 => 'Варшава',
    1 => 'Гданськ',
    2 => 'Пшемысль',
    3 => 'Сопот',
    4 => 'Закопане',
  ),
);

?>
